Tekla Open API Reference for Tekla Structures 2025
GridSurface.Parent Property
 The parent grid of the grid surface.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GridBase Parent { get; set; }
Public Property Parent As GridBase
	Get
	Set
Property Value
Type: GridBase
See Also
Reference
GridSurface Class
Tekla.Structures.Model Namespace